Revit 2026 API

# FabricationServiceSettingsRemoveFluidSetting Method

---

Clears the fluid setting of the specified service if found.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveFluidSetting(
	FabricationService service
)
```
```vb
Public Sub RemoveFluidSetting (
	service As FabricationService
)
```
```cpp
public:
void RemoveFluidSetting(
	FabricationService^ service
)
```
```fsharp
member RemoveFluidSetting :
        service : FabricationService -> unit
```

#### Parameters

service FabricationService
     The service to clear.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FabricationServiceSettings Class

Autodesk.Revit.DB Namespace